In [1]:
import pandas as pd

# Sample DataFrame

data = {
'Name': ['Alice', 'Bob', 'Charlie'],
'Math': [85, 78, 92],
'Science': [90, 82, 89],
'English': [88, 85, 94]
}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [4]:
df = df.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score")

# id_vars -> Kon sa same rakhna hai -> Name
# value_vars -> Kis column ko aggregate karna hai -> Math,Science,English
# var_name -> New aggregate column ka kya naam rakhna hai -> Subject
# value_name -> Ko score naam ka column ma rakhuga -> Score

# ["Math", "Science", "English"]  -> Subject

In [5]:
df

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [6]:
# Pivot is reverse of mely

df = df.pivot(index="Name", columns="Subject", values="Score")

In [7]:
df

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

In [8]:
df = df.reset_index()

In [9]:
df

Subject     Name  English  Math  Science
0          Alice       88    85       90
1            Bob       85    78       82
2        Charlie       94    92       89

In [10]:
# If duplicate values are present use aggregation funtion

# df.pivot_table(index="Name", columns="Subject", values="Score", aggfunc="mean")